ducted_fan/system/fvSolution
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  11
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    object      fvSolution;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

solvers
{
    p
    {
      // solver          GAMG;
      // smoother        DICGaussSeidel;
      // tolerance       1e-6;
      // relTol          0.01;
      // cacheAgglomeration no;
      // maxIter         50;

      solver GAMG;
      smoother DICGaussSeidel;
      tolerance 1e-6;
      relTol 0.02;               // 初期は0.05〜0.1で様子見
      cacheAgglomeration yes;
      nCellsInCoarsestLevel 100;  // 50〜100推奨
      agglomerator faceAreaPair;
      maxIter         50;
    }

    pFinal
    {
        $p;
        relTol          0;
    }
    "pcorr.*"
    {
        $p;
        tolerance       1e-2;
        relTol          0;
    }

    MeshPhi
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-2;
        relTol          0;
    }

    "(U|k|epsilon)"
    {
        solver          smoothSolver;
        smoother        symGaussSeidel;
        tolerance       1e-6;
        relTol          0.1;
    }

    "(U|k|epsilon)Final"
    {
        $U;
        relTol          0;
    }
}

PIMPLE
{
    correctPhi          yes;
    correctMeshPhi      yes;
    nOuterCorrectors    2;
    nCorrectors         2;
    nNonOrthogonalCorrectors 2;
    pRefCell 0;
    pRefValue 0;
}

relaxationFactors
{
    // "(U|k|epsilon).*"   1;
    U                   0.7;
    k                   0.5;
    epsilon             0.5;
    p                   0.3;
}

cache
{
    grad(U);
}

// ************************************************************************* //
